# Итоговая проверочная работа

## **Задача**

### Написать программу, которая из имеющегося массива строк формирует массив из строк, длина которых меньше либо равна 3 символа.
*Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма.*
<br>
*При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.*

**Примеры:** 
<br>
["hello", "2", "world", ":-)"] -> ["2", ":-)"]
<br>
["1234", "1567", "-2", "computer science"] -> ["-2"]
<br>
["Russia", "Denmark", "Kazan"] -> []

<br>

___
<br>

Первоначальный массив **arrayInput** (пусть будет задан на старте выполнения алгоритма).

```c#
string[] arrayInput = new string[]{"Hello", "world", "!", ":-)", "1234", "-2", "computer science", "RU", "Russia"};
```

Функция заполнения целевого массива из **arrayInput** строками, длина которых меньше либо равна 3 символа.
```c#
string[] fillArrayOut (string[] arrayIn)
{
    // Пустой целевой массив
    string[] arrayOut = new string[0];
    // Индекс для целевого массива
    int j = 0;
    // Цикл по элементам (строкам) первоначального массива
    for (int i = 0; i < arrayIn.Length; i++)
    {
        // Проверка длины строки
        if (arrayIn[i].Length <= 3)
        {
            // Изменяем размер целевого массива на +1
            Array.Resize<string>(ref arrayOut, j+1);
            arrayOut[j] = arrayIn[i];
            j++;
        }
    }
    return arrayOut;
}
```

Функция вывода результата в терминал.
```c#
void printArray (string[] array)
{  
    // Формат вывода как в примерах - массив в []
    Console.Write("[");
    // Цикл по элементам (строкам) массива
    for (int i = 0; i < array.Length; i ++)
    {
        Console.Write(array[i]);
        // Если строка не последняя, то добавляем ","
        if (i < array.Length-1) Console.Write(", ");
    }
    Console.WriteLine("]");
}
```
